app/Http/Controllers/Academia/MathOlympicsController.php

   public function index()
   {

     $data =  MathOlympicsModel::all();
---
SELECT * FROM `academia_math_olympics`