app/Http/Controllers/Academia/SolutionsController.php

SELECT * FROM `universities` WHERE `short_name` = 'San Marcos' LIMIT 1
---
   public function index($university)
   {
      $university = University::where('short_name', $this->l($university))->first();